import java.util.Arrays;

public class Main {
    public static void main(String[] args) {
        System.out.println("Домашнее задание Методы. Задание 1.");
        /*### Задание 1
        Реализуйте метод, который получает в качестве параметра год, а затем проверяет, является ли он високосным,
        и выводит результат в консоль.
        *Эту проверку вы уже реализовывали в задании по условным операторам.*
        Теперь проверку нужно обернуть в метод и использовать год, который приходит в виде параметра.
        Результат программы выведите в консоль. Если год високосный, то должно быть выведено “*номер года —* високосный год”.
        Если год не високосный, то, соответственно: “*номер года —* не **високосный год”.
        *Подсказку с выполнением задания вы можете найти в шпаргалке урока.*
        - **Критерии оценки**
        – Метод реализован корректно.
        – Название метода начинается с глагола, написано в camelCase и описывает действия метода
        – При изменении значения года программа выводит корректный результат.
        – В консоль выведены результат программы.
         */

    }
}